{
  "about": {
    "title": "JavaScript Developer",
    "description": "Jestem programistą z pasją do rozwiązywania problemów. Lubię angażować się w ciekawe projekty, które wymagają kreatywnego myślenia. Jestem ambitną osobą, która dąży do osiągnięcia swoich celów.",
    "email": "E-mail",
    "projects": "Moje projekty"
  },
  "projects": {
    "polyform": {
      "title": "PolyForm",
      "description": [
        "Podobne do Google Forms narzędzie do tworzenia formularzy i przeglądu wyników. Zaprojektowany z myślą o prostocie.",
        "Oprócz eleganckiego frontu w Angularze, stworzyłem również obszerny serwer API w NestJS zapewniający bezpieczeństwo danych i kontrolę ich typów."
      ]
    },
    "webflowrepo": {
      "title": "Repozytorium WebFlow",
      "description": [
        "Prototyp prostej galerii dla komponentów dla platformy WebFlow. Zawiera opcje filtrowania, łatwe zarządzanie elementami i stylizowany interfejs. Wykorzystuje API Firebase oraz Angular",
        "Proszę o kontakt w sprawie loginu do panelu administracyjnego."
      ]
    },
    "derry": {
      "title": "Wirtualny przewodnik po Derry",
      "description": [
        "Wirtualny przewodnik dla miasta Derry stworzony w ramach projektu Erasmus w Irlandii Północnej. Odpowiadałem za stworzenie interaktywnej mapy miejsc opisanych w przewodniku oraz obsługę API strony.",
        "Zyskał uznanie ze strony recenzentów i społeczności lokalnej."
      ]
    },
    "timeline": {
      "title": "GitHub Timeline",
      "description": [
        "Proste narzędzie do wizualizacji aktywności repozytorium GitHub. Pozwala zobaczyć działalność w formacie osi czasu oraz zapewnia przystępny przegląd wybranego commita."
      ]
    },
    "nocodelib": {
      "title": "Biblioteka komponentów No-Code",
      "description": [
        "Obecnie biorę udział w tworzeniu usługi dla wstępnie utworzonych komponentów dla różnych platform no-code.",
        "W projekcie jestem odpowiedzialny za podłączenie wtyczek z API i tworzenie panelu administracyjnego w Angularze dla zarządzania użytkownikami i zasobami oraz przeglądem statystyk."
      ]
    }
  }
}
